Public Attributes | List of all members
API_StairStructureComponentSettingsVisibilityOnStory Struct Reference
Element Manager
Describes story's stair structure component visibility settings. More...
#include <APIdefs_Elements.h>
 Public Attributes
 bool  | structureVisibility [API_StairStructSymbPartNum][API_StairStructSymbVisibilityNum]
 bool  | fillVisibility [API_StairStructSymbPartNum][API_StairStructSymbTypeNum]
 API_MonolithPartsVisibilityData  | monolithPartsVisibility [API_StairStructSymbPartNum]
Detailed Description
Describes story's stair structure component visibility settings.